# กำหนด list ของกำไร(หรือขาดทุน)รายเดือน ของบริษัท สโคดิอู้ จำกัด (มหาชน) ดังนี้ ในหน่วยพันล้านบาท
net_profits = [2574.99, -104.4, 4750.0, 1566.65, 4297.64, 3684.8, 673.09, -229.02, 624.9, -126.56, 4498.43, 2168.16]

# จงสร้าง list ที่บอกว่า เดือนไหนกำไร เดือนไหนขาดทุน โดยที่
# ถ้าค่า >= 0 ให้ระบุว่า "กำไร"
# ถ้าค่า < 0 ให้ระบุว่า "ขาดทุน"
# บันทึกผลใส่ตัวแปร profit_or_loss
profit_or_loss = ["กำไร" if p >= 0 else "ขาดทุน" for p in net_profits]
print(profit_or_loss)

# กำหนด list ของกำไร(หรือขาดทุน)รายเดือน ของบริษัท สโคดิอู้ จำกัด (มหาชน) ดังนี้ ในหน่วยพันล้านบาท
net_profits = [2574.99, -104.4, 4750.0, 1566.65, 4297.64, 3684.8, 673.09, -229.02, 624.9, -126.56, 4498.43, 2168.16]

# และกำหนดเป้าหมายกำไรดังนี้
target_profits = [500, 1000, 4000, 2000, 3000, 1500, 6000, 2000, 1200, 500, 3000, 2000]

# (Challenge) จงสร้าง list ที่บอกว่า เดือนไหน ทำกำไรได้ตามเป้า โดยที่
# ถ้ากำไรที่ได้มากกว่าหรือเท่ากับเป้าในเดือนนั้น ให้ระบุว่า "ตามเป้า"
# ถ้ากำไรที่ได้น้อยกว่าเป้าในเดือนนั้น ให้ระบุว่า "ตกเป้า"
# บันทึกผลใส่ตัวแปร profit_performance
profit_performance = ["ตามเป้า" if net_profits[i] > target_profits[i] else "ตกเป้า" for i in range(len(net_profits))]
print(profit_performance)